---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointOrientationType.ToHostAndLoopSystem
enum: Autodesk.Revit.DB.AdaptivePointOrientationType
source: html/95bf6f69-8714-5342-8a43-ad4f6c8b05a7.htm
---
# Autodesk.Revit.DB.AdaptivePointOrientationType.ToHostAndLoopSystem

The adaptive point will be oriented to the coordinate system of the geometry the point is hosted on.
 However, the orientation of the Z axis is controlled by the order of placed points. If the placed
 adaptive points of a component are placed in a different order with respect to the host order,
 (clockwise instead of counter-clockwise), then the Z axis will invert and the planar projection will flip. This option was previously named: HostReferenceAutoFlip.